[
  {
    "title": "ShopEase Web App",
    "description": "ShopEase is a dynamic and user-friendly e-commerce web application built with React, JavaScript, and Redux. With state management powered by Redux, ShopEase ensures real-time updates and a highly interactive user interface.",
    "githubRepo": "https://github.com/locbuigia/shop-ease-web-app",
    "demoUrl": "https://locbui-shopease.netlify.app"
  },
  {
    "title": "ShopEase Mobile App",
    "description": "This e-commerce mobile app, built with React Native, TypeScript, and Redux, offers a seamless shopping experience with an intuitive interface, real-time updates, and efficient state management. Users can browse products, manage carts, and enjoy fast performance and smooth navigation.",
    "githubRepo": "https://github.com/locbuigia/shop-ease-mobile-app",
    "demoUrl": "src/assets/files/ShopEase-Mobile-App-Demo.webm"
  },
  {
    "title": "Loc's Personal Website",
    "description": "I built my personal website using React for a dynamic and interactive user interface, JavaScript for seamless functionality, and CSS Tailwind to design a clean, responsive layout.",
    "githubRepo": "https://github.com/locbuigia/loc-personal-website-react"
  },
  {
    "title": "GradTrack Web App",
    "description": "Using high level of ReactJS with Javascript to manipulate UI with dynamic data using MongoDB for organizing the employment information of graduate students.",
    "githubRepo": "https://github.com/locbuigia/GradTrackWebApp"
  },
  {
    "title": "ParkingApplication",
    "description": "This is a collaborative team project connecting Java Swing with MySQL to create a database that kept track of an organization’s parking lot.",
    "githubRepo": "https://github.com/jnbui94/ParkingApplication"
  },
  {
    "title": "OutOfGas",
    "description": "This Android application was to help drivers search nearby gas stations using GPS. This program implemented the Google Maps API to create a map view for users, and made calls to a web service to connect to a database.",
    "githubRepo": "https://github.com/locbuigia/OutOfGas"
  }
]
